app/controllers/batches_controller.rb

SELECT "batches".* FROM "batches" WHERE "batches"."location" = '#rack_2' LIMIT 1
---
  def rack
    render json: {batch: Batch.find_by_location("#rack_" + params[:id]), j: params[:id]}