app/controllers/batches_controller.rb

SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    batch = Batch.find(params[:id])

INSERT INTO "batches" ("bake_time", "cookie_status", "cookie_type", "created_at", "location", "time_baked", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    batch = Batch.new
    batch.cookie_type = params[:cookie_type]
    batch.bake_time = params[:bake_time]
    batch.save

SELECT "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT 1  [["id", "11"]]
UPDATE "batches" SET "cookie_status" = 'still_gooey', "updated_at" = '2013-09-04 13:42:30.908923' WHERE "batches"."id" = 13
---
  def update
    batch = Batch.find(params[:id])
    batch.location = params[:location] if params[:location]
    batch.cookie_status = params[:cookie_status] if params[:cookie_status]
    batch.save

SELECT "batches".* FROM "batches" WHERE "batches"."location" = 'prep_table'
---
  def prep_table
    render json: Batch.find_all_by_location('prep_table')

SELECT "batches".* FROM "batches" WHERE "batches"."location" = '#rack_0' LIMIT 1
---
  def rack_0
    render json: Batch.find_by_location('#rack_0')