app/controllers/static_controller.rb

SELECT "batches".* FROM "batches" WHERE "batches"."location" = 'prep_table' LIMIT 1
---
  def index
    @prep_table = Batch.find_all_by_location('prep_table')